## TechParva - Datathon
## Team SegFault

In [2]:
import numpy as np
import matplotlib as plt
import pandas as pd
import seaborn as sb

In [39]:
plt.style.use('fivethirtyeight')

In [12]:
!wget https://raw.githubusercontent.com/bimarshak7/my_nepal/master/my_nepal.csv -q -O dataset/my_nepal.csv

In [19]:
total_voters = pd.read_csv("dataset/total_voters.csv")
total_voters

        District     Male   Female  Third Gender     Total
0         Achham    60441    67299             2    127742
1   Arghakhanchi    60296    66403             0    126699
2        Baglung    73963    82839             0    156802
3        Baitadi    60227    64596             1    124824
4        Bajhang    47888    49721             1     97610
..           ...      ...      ...           ...       ...
75        Tanahu    90144  3104327             0    194471
76     Taplejung    37187    33591             0     70778
77     Terhathum    30334    30370             0     60704
78      Udayapur    88510    86951             0    175461
79         Total  7069714  6984625           143  14054482

[80 rows x 5 columns]

Oops! There are only 77 district in Nepal, but data shows.

!!! Duplicate data alert

In [21]:
total_voters.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 80 entries, 0 to 79
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   District      80 non-null     object
 1   Male          80 non-null     int64
 2   Female        80 non-null     int64
 3   Third Gender  80 non-null     int64
 4   Total         80 non-null     object
dtypes: int64(3), object(2)
memory usage: 3.2+ KB

In [22]:
# Total should be integer but object xa hya, so some missing values

In [ ]:
df[]

In [23]:
total_voters.isna().sum()

District        0
Male            0
Female          0
Third Gender    0
Total           0
dtype: int64

In [24]:
dupli_voters = total_voters[total_voters.duplicated(['District'])]
dupli_voters

              District   Male   Female  Third Gender     Total
28            Jajarkot  42410    36536             1      ????
29            Jajarkot  42410    36536             1      ????
50  Nawalparasi (East)  80316    89570             4   2212111
75              Tanahu  90144  3104327             0    194471

In [30]:
total_voters = total_voters.drop_duplicates(keep="first")
total_voters.shape

(77, 5)

In [33]:
# total ma chai misijng values xa, male+female ko toal...

In [34]:
total_voters['Total'] = total_voters['Male'] + total_voters['Female']

In [32]:
total_voters.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 77 entries, 0 to 79
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   District      77 non-null     object
 1   Male          77 non-null     int64
 2   Female        77 non-null     int64
 3   Third Gender  77 non-null     int64
 4   Total         77 non-null     int64
dtypes: int64(4), object(1)
memory usage: 3.6+ KB

In [35]:
province = pd.read_csv("dataset/my_nepal.csv")
province.drop(['District code', 'X', 'Y'], axis=1, inplace=True)
province

         Province       District
0      PROVINCE 1      Taplejung
1      PROVINCE 1  Sankhuwasabha
2      PROVINCE 1     Solukhumbu
3      PROVINCE 1    Okhaldhunga
4      PROVINCE 1        Khotang
..            ...            ...
72  SUDURPASHCHIM     Dadeldhura
73  SUDURPASHCHIM           Doti
74  SUDURPASHCHIM         Achham
75  SUDURPASHCHIM        Kailali
76  SUDURPASHCHIM     Kanchanpur

[77 rows x 2 columns]

In [37]:
merged = pd.merge(total_voters, province, on ='District')
merged

        District   Male  Female  Third Gender   Total       Province
0         Achham  60441   67299             2  127740  SUDURPASHCHIM
1   Arghakhanchi  60296   66403             0  126699     PROVINCE 5
2        Baglung  73963   82839             0  156802        GANDAKI
3        Baitadi  60227   64596             1  124823  SUDURPASHCHIM
4        Bajhang  47888   49721             1   97609  SUDURPASHCHIM
..           ...    ...     ...           ...     ...            ...
67       Surkhet  89268   95131             0  184399        KARNALI
68       Syangja  89544  101708             1  191252        GANDAKI
69     Taplejung  37187   33591             0   70778     PROVINCE 1
70     Terhathum  30334   30370             0   60704     PROVINCE 1
71      Udayapur  88510   86951             0  175461     PROVINCE 1

[72 rows x 6 columns]

In [41]:
province_rec = merged.groupby(['Province']).aggregate({'Male':np.sum,'Female':np.sum,'Third Gender':np.sum,'Total':np.sum})
province_rec

                  Male   Female  Third Gender    Total
Province
GANDAKI         488081   539626             8  1027707
KARNALI         355696   614275             1   969971
PROVINCE 1     1346942  1327615             7  2674557
PROVINCE 2     1429935  1234798            59  2664733
PROVINCE 3     1366103  1394051            28  2760154
PROVINCE 5     1041325  1119636            17  2160961
SUDURPASHCHIM   634379   669321            14  1303700